Tekla Open API Reference for Tekla Structures 2025
TeklaDrawingColor Properties
The TeklaDrawingColor type exposes the following members.
Properties
Name | Description
DrawingColorEnum
 Enum for the drawing color
RGBColor
 Red, Green, Blue representation of the color.
Top
See Also
Reference
TeklaDrawingColor Structure
Tekla.Structures.Drawing Namespace